Магазин_ГаджетОнОфф/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокПрав</name>
    <attributes>
      <name>ПредставлениеРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Активна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Магазин_ГаджетОнОфф/src/Catalogs/Пользователи/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	ТекПользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	
	Если ТекПользователь = Неопределено Тогда
		ТекПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		ТекПользователь.Имя = Наименование;
		ТекПользователь.ПолноеИмя = ПолноеИмя;
	КонецЕсли;
	
	СписокРолей = СписокПрав.НайтиСтроки( Новый Структура("Активна", Истина) );
	Для Каждого СтрокаТЧ Из СписокРолей Цикл
		ТекПользователь.Роли.Добавить(Метаданные.Роли.Найти(СтрокаТЧ.ИмяРоли));		
	КонецЦикла;
	ТекПользователь.Записать();
	
КонецПроцедуры


// Описание
// 
// Параметры:
// 	ТекПользователь - ПользовательИнформационнойБазы -
Процедура ЗаполнитьТаблицуПрав( ТекПользователь ) Экспорт
	
	СписокПрав.Очистить();
	
	НаборРолей = Метаданные.Роли;
	
	Для Каждого ТекРоль Из НаборРолей Цикл
		СтрокаТЧ = СписокПрав.Добавить();
		СтрокаТЧ.ИмяРоли = ТекРоль.Имя;
		СтрокаТЧ.ПредставлениеРоли = ТекРоль.Синоним;
		СтрокаТЧ.Активна = ТекПользователь.Роли.Содержит(ТекРоль);						
	КонецЦикла;
	
КонецПроцедуры
